// Суворий режим
"use strict"


// -------------- HOME WORK --------------
// Задача №1
// Що потрапить в консоль?

// let someVar = 0;
// ++someVar;

// if (someVar) {
// 	console.log(someVar);
// }

// 1
console.log(`- Задача №1 -`);
let someVar = 0
++someVar

if (someVar) {
    console.log(someVar);
}

console.log(` `);
// ---------
// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.
console.log(`- Задача №2 -`);
for (let i = 1; i < 11; ++i)  {
    console.log(`Пункт №${i}`);
}

console.log(` `);
// ---------
// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
// 	console.log('000');
// }
// 1) Перша дія застосування математичних операторів
// if (40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20")
// 2)  застосування  оператори порівняння
// if (false || false && true || false)
// 3)  застосування  логічного оператора &&
// if (false || false  || false)
// 4)  застосування  логічного оператора ||
// if (false)
// Відповідь нічого не буде виведено в консоль)

// ---------
// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку 
console.log(`- Задача №4 -`);
const someTextResult = "Результат ділення:"
let calcDiv = (a = 0, b = 0) => { return (a / b) }
let showMessage = (someText = "Порожньо") => {
    console.log(someText)
}
showMessage(`${someTextResult} ${calcDiv(10, 2)}`)
showMessage(`${someTextResult} ${calcDiv(100, 2)}`)
showMessage(`${someTextResult} ${calcDiv(3, 2)}`)
showMessage()

console.log(` `);
// ---------
// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
console.log(`- Задача №5 -`);
let someArray = ["Жека", "Artem", 5, "Саша", 10]
someArray.forEach(someNum => {
    someNum === 10 ? console.log(someNum) : null
})

